Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/prod-ue2-sharedservices.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-sharedservices.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.ssm_send_command_policy must be replaced
-/+ resource "aws_iam_policy" "ssm_send_command_policy" {
      ~ arn              = "arn:aws:iam::481665084477:policy/anime_ssm_send_command_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Policy to allow Lambda functions to send SSM commands on EC2 instances" -> "Policy to allow Lambda functions full access to SSM" # forces replacement
      ~ id               = "arn:aws:iam::481665084477:policy/anime_ssm_send_command_policy" -> (known after apply)
      ~ name             = "anime_ssm_send_command_policy" -> "anime_ssm_full_policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "ssm:SendCommand" -> "ssm:*"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ policy_id        = "ANPAXAJLZ5Q6XDLZI2Y5P" -> (known after apply)
      - tags             = {} -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.attach_ssm_send_command_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_ssm_send_command_policy" {
      ~ id         = "anime_lambda_role-20250226165034936900000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::481665084477:policy/anime_ssm_send_command_policy" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedMatrix%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```